Autodesk.Revit.DB.ValueAtPointFlags
Enumerated type containing flags related to the display on particular points.
Enumerated type that stores bit values of flags that can be set at any domain point.
Since:
2012

Autodesk.Revit.DB.ValueAtPointFlags.DisplayFence
Show fence for the point if allowed by display style (applies only to diagram display style)

Autodesk.Revit.DB.ValueAtPointFlags.DisplayText
Show text marker for the point if allowed by display style (applies only to certain display styles)

Autodesk.Revit.DB.ValueAtPointFlags.None
No flags set